load-test.yml
config:
  target: "http://localhost:5000"   # Your backend URL
  phases:
    - duration: 60   # Run the test for 60 seconds
      arrivalRate: 10   # 10 requests per second

scenarios:
  - flow:
      - get:
          url: "/earthquakes"   # Your API endpoint
      - get:
          url: "/earthquakes/us7000k7lf"   # Fetch earthquake details by ID